In [36]:
import numpy as np
import pandas as pd
import math

In [3]:
dict ={"Name":["Ram","Raj","Shyam","Guru"],
      "Marks":[89,69,35,78],
       "City":["Gurgaon","Hyderabad","Bangalore","Pune"]}

In [4]:
df=pd.DataFrame(dict) # making dataframe from dict

In [5]:
print(df)

    Name  Marks       City
0    Ram     89    Gurgaon
1    Raj     69  Hyderabad
2  Shyam     35  Bangalore
3   Guru     78       Pune

In [6]:
df.to_csv("Marks.csv")  # converting dataframe to csv file

In [7]:
df.to_csv("Marks_No_Index.csv",index=False)  # without index

In [8]:
df.head(2) # first 2 rows

  Name  Marks       City
0  Ram     89    Gurgaon
1  Raj     69  Hyderabad

In [9]:
df.tail(2)  # last 2 rows

    Name  Marks       City
2  Shyam     35  Bangalore
3   Guru     78       Pune

In [10]:
df.describe() # gives statistical details of the data

           Marks
count   4.000000
mean   67.750000
std    23.314874
min    35.000000
25%    60.500000
50%    73.500000
75%    80.750000
max    89.000000

In [13]:
df.info()  # info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [17]:
train=pd.read_csv("train.csv")
print(train)

       Train  Number       City
0    Doronto   12365    Gurgaon
1  Shatabdhi   13654  Hyderabad
2   Rajdhani   14563  Bangalore
3     Sabari   12369       Pune

In [31]:
# def ls(n):
#     i=1
#     for i in range(n):
#         yield i+1
# train.index=ls(len(train))

# train.index=[1,2,3,4]
train

       Train  Number       City
1    Doronto   12365    Gurgaon
2  Shatabdhi   13654  Hyderabad
3   Rajdhani   14563  Bangalore
4     Sabari   12369       Pune

In [53]:
ser=pd.Series((np.random.rand(10))*10)
ser

0    0.518412
1    1.603219
2    2.894456
3    5.090295
4    0.947109
5    4.274650
6    7.414638
7    2.852845
8    9.223250
9    8.488411
dtype: float64

In [49]:
type(ser)

pandas.core.series.Series

In [58]:
newdf=pd.DataFrame(np.random.rand(100,5),index=np.arange(100))
newdf

           0         1         2         3         4
0   0.114882  0.444578  0.387023  0.936953  0.895224
1   0.170340  0.837541  0.686888  0.684797  0.662975
2   0.078500  0.758287  0.912369  0.277404  0.806145
3   0.281285  0.612919  0.392783  0.754336  0.671592
4   0.150205  0.397742  0.073208  0.026029  0.364423
..       ...       ...       ...       ...       ...
95  0.372456  0.553609  0.770727  0.917227  0.316970
96  0.047922  0.550775  0.990051  0.114492  0.895104
97  0.876749  0.875081  0.685398  0.544539  0.979513
98  0.880706  0.715901  0.935628  0.149539  0.510822
99  0.407700  0.270356  0.163855  0.007510  0.365460

[100 rows x 5 columns]

In [60]:
type(newdf)
newdf.describe()  # returns statistical details

                0           1           2           3           4
count  100.000000  100.000000  100.000000  100.000000  100.000000
mean     0.440598    0.530884    0.508118    0.527551    0.549639
std      0.275277    0.280630    0.294709    0.302350    0.271619
min      0.005473    0.000358    0.022974    0.005641    0.008697
25%      0.212967    0.292359    0.245220    0.269591    0.355961
50%      0.380407    0.575596    0.520909    0.546387    0.528330
75%      0.675933    0.755201    0.778729    0.808379    0.782683
max      0.992983    0.978161    0.994063    0.993879    0.997460

In [62]:
newdf.dtypes  # returns datatypes of columns

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object